import React from 'react';
import Counter from './Counter';

class Block1 extends React.Component {
    render() {
        return (
            <div className='block__1'>
                <div className='content'>
                    <h1>อาหารคาว</h1>
                    <h3>กระเพรา</h3>
                    <p>จากหลักฐานจดหมายเหตุลาลูแบร์ (พ.ศ. 2230) ได้ระบุถึงใบกะเพราไว้ว่า “…ผักลางชนิดที่มีกลิ่นดี เช่น กะเพรา…” มีข้อสันนิษฐานน่าจะรับเอาต้นกะเพรามาจากศาสนาพราหมณ์ เพราะพราหมณ์ มักจะใช้กะเพราสำหรับบูชาเทพเจ้า ส่วนที่บันทึกไว้ใน อักขราภิธานศรับท์ ของหมอบรัดเล พ.ศ. 2416 ให้ความหมายว่า "ผักอย่างหนึ่งต้นเล็ก ๆ ใบกลิ่นหอม ใช้แกงกินบ้าง ทำยาบ้าง"
                        ผัดกะเพราน่าจะเกิดขึ้นราวสมัยรัชกาลที่ 7 เพราะคนจีนนำเอามาขายในร้านอาหารตามสั่ง อย่างไรก็ดี ผัดกะเพราน่าจะเพิ่งนิยมราว พ.ศ. 2500 โดยน่าจะดัดแปลงจากอาหารจีน ที่ตำรับจีน เอาเต้าเจี้ยวดำผัดกับกระเทียมเจียวให้หอม แล้วจึงเอาเนื้อสับหรือไก่หั่นเป็นชิ้น ๆ ลงไปผัดกับน้ำปลาและซีอิ๊วดำ บ้างก็ว่าเลียนแบบมาจากเนื้อผัดใบยี่หร่า สำหรับผัดกะเพราที่ปรากฏในตำรากับข้าวยุคปลายทศวรรษ 2520 อย่างใน 
                        ตำราอาหารชุดจัดสำรับ  ระบุว่า ผัดกะเพราเนื้อจะปรุงด้วยน้ำปลาและผงชูรสเท่านั้น แล้วเอาข้าวลงผัดคลุกเป็นข้าวผัด กินกับถั่วฝักยาวสด ส่วนใน กับแกล้มเหล้า ประมวลกับแกล้มเหล้า–เบียร์ทันยุค ของ “แม่ครัวเอก” (พ.ศ. 2541) ระบุว่า จะหมักเนื้อสับกับเหล้าก่อน แล้วปรุงเพียงน้ำปลาและน้ำตาลปี๊บ ในระยะหลัง ๆ จึงค่อยใส่ซอสปรุงรสชนิดต่าง ๆ น้ำตาลทราย น้ำมันหอย รสดี น้ำพริกเผา ฯลฯ</p>
                    <div className='counter'>
                        <Counter />
                    </div>
                </div>
                <img src="https://media.istockphoto.com/id/1216942370/th/%E0%B8%A3%E0%B8%B9%E0%B8%9B%E0%B8%96%E0%B9%88%E0%B8%B2%E0%B8%A2/%E0%B8%9C%E0%B8%B1%E0%B8%94%E0%B8%81%E0%B8%A3%E0%B8%B0%E0%B9%80%E0%B8%9E%E0%B8%A3%E0%B8%B2%E0%B9%84%E0%B8%81%E0%B9%88%E0%B8%81%E0%B8%B0%E0%B9%80%E0%B8%9E%E0%B8%A3%E0%B8%B2%E0%B8%81%E0%B8%B1%E0%B8%9A%E0%B8%82%E0%B9%89%E0%B8%B2%E0%B8%A7%E0%B9%81%E0%B8%A5%E0%B8%B0%E0%B9%84%E0%B8%82%E0%B9%88%E0%B8%94%E0%B8%B2%E0%B8%A7%E0%B9%81%E0%B8%A2%E0%B8%81%E0%B8%9A%E0%B8%99%E0%B8%9E%E0%B8%B7%E0%B9%89%E0%B8%99%E0%B8%AB%E0%B8%A5%E0%B8%B1%E0%B8%87%E0%B8%AA%E0%B8%B5%E0%B8%82%E0%B8%B2%E0%B8%A7-%E0%B8%9C%E0%B8%B1%E0%B8%94%E0%B8%81%E0%B8%A3%E0%B8%B0%E0%B9%80%E0%B8%9E%E0%B8%A3%E0%B8%B2%E0%B9%80%E0%B8%9B%E0%B9%87%E0%B8%99%E0%B8%AD%E0%B8%B2%E0%B8%AB%E0%B8%B2%E0%B8%A3%E0%B9%84%E0%B8%97%E0%B8%A2%E0%B8%81%E0%B8%B1%E0%B8%9A%E0%B9%84%E0%B8%81%E0%B9%88%E0%B8%AA%E0%B8%B1%E0%B8%9A%E0%B8%AB.jpg?s=1024x1024&w=is&k=20&c=aGn2QmqF0UOmFQgEOrE2exVQZC8BA56QvKfdRGAGT0I=" / >
                
            </div>
            );
        }
        }

export default Block1;