import React from 'react';
import Counter from './Counter';

class Block1 extends React.Component {
    render() {
        return (
            <div className='block__2'>
                <div className='content'>
                    <h1>ขนมหวาน</h1>
                    <h3>ขนมเปียกปูน</h3>
                    <p>ขนมเปียกปูน เป็นขนมไทยประเภทกวน มักมีสีดำซึ่งได้จากกาบมะพร้าวเผาไฟ และสีเขียวเข้มที่ได้จากน้ำใบเตยคั้น
                        สันนิษฐานว่าดัดแปลงมาจากกะละแมแต่ไม่ใส่กะทิสด ทำจากแป้งหมักเช่นเดียวกับขนมจีนหรือลอดช่อง ส่วนผสมในอดีตประกอบด้วย แป้งข้าวเจ้าหมักทิ้งไว้ แล้วนำมาโม่ด้วยโม่หินให้ละเอียดจนเป็นน้ำแป้ง ผสมน้ำตาลปี๊บ น้ำตาลทราย ใบตาลเผาไฟ (ส่วนใหญ่ไม่ค่อยนิยม) และน้ำปูนใส เมื่อกวนเสร็จนำมาใส่ถาดทรงสี่เหลี่ยม หากเป็นสมัยโบราณเป็นถาดโบราณรูปทรงกลม เมื่อขนมแห้งตึงดีจึงใช้มีดตัดแบ่งออกพอเป็นคำ ๆ 
                        ชาวบ้านเรียกติดปากว่า "สี่เหลี่ยมขนมเปียกปูน" เวลารับประทานโรยด้วยมะพร้าวอ่อนขูดฝอยเคล้ากับน้ำเกลือหรือเกลือป่น ส่วนวัตถุดิบในปัจจุบัน คือ แป้ง น้ำตาล และน้ำใบเตย หรือน้ำจากกาบมะพร้าวเผาไฟ
                        ขนมเปียกปูนกับขนมเปียก (หรือขนมเปียกอ่อน) มีลักษณะคล้ายกัน ขนมเปียกมีสีน้ำตาลที่ได้มาจากน้ำตาลโตนด ซึ่งเป็นส่วนผสมสำคัญของขนมเปียก ขนมเปียกมีเนื้อขนมที่ร่วนกว่าขนมเปียกปูน เนื่องจากไม่ได้ใส่น้ำปูนใส แต่จะเพิ่มหัวกระทิเข้าไป ทำให้ขนมเปียกมีรสชาติหวานมันมากกว่าขนมเปียกปูน มักรับประทานขนมเปียกกับถั่วทอง (ถั่วเขียวกระเทาะเปลือก)</p>
                    <div className='counter'>
                        <Counter />
                    </div>
                </div>
                
                <img src="https://i0.wp.com/kinpungkang.com/wp-content/uploads/2021/03/%E0%B9%80%E0%B8%9B%E0%B8%B5%E0%B8%A2%E0%B8%81%E0%B8%9B%E0%B8%B9%E0%B8%99002-20210324.jpg?resize=1080%2C1080" / >
                
            </div>
            );
        }
        }

export default Block1;